docs/design.tex
% Created 2018-05-13 Sun 19:13
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Indledning}
\label{sec:orga87693e}
Der skal designes og implementeres en 2D game engine.

\section{Forord}
\label{sec:org7d89220}
Tak til folk… 


\section{Tidsplan}
\label{sec:orgdd88ca9}
Der bliver ikke lagt en tidsplan. Der bliver lagt en plan der ikke er begrænset af tid. SCRUM måske?

\section{Problemformulering}
\label{sec:org3385379}
Der skal designes en simpel Game Engine som man kan arbejde ud fra når der bliver lavet spil. \\
Der skal nemt kunne laves elementer i et vindue, give elementer forskellige attributter \\
(som lyd, kollision, kamera) og man skal kunne bevæge elementerne i forhold til deres relative position. $\backslash$\$\backslash$\

Det skal være en Game Engine der kan tage i mod et TileMap og bruge det som map.


\section{Systemvision}
\label{sec:orgf878431}
\subsection{Funktionelle krav}
\label{sec:orga4c6dff}
Kan håndtere oprettelse og manipulation af et vindue
Kan tilføje ubegrænsede elementer til vinduet og prioritere hvilken rækkefølge det skal vises i.
Kan afspille lyd på de tilføjede elementer.
Kan håndtere kollision i mellem elementerne.
Det skal kunne vise de elementer i en manér der ikke er komprimerende for performance. 
\subsection{Minimumskrav for performance er:}
\label{sec:org49058c2}
Et baggrunds element.
Elementer der kører ovenpå baggrunds elementet, min. 10 elementer.
Netværks håndtering (skal måske være en pakke for sig).

\section{Ikke-funktionelle krav}
\label{sec:org967f29a}
GUI.

\section{Teknologi}
\label{sec:org2c7e3c6}
\begin{itemize}
\item Hvilken teknologi (web, windows, mobil, touch, rfid osv) og hvorfor?
\item Windows 10.
\item java.
\item Laptop preferably.
\item Swing.
\item Awt.
\item Keyboard og mus.
\end{itemize}


\section{Domænemodel}
\label{sec:orgceae129}

\section{Arkitektur}
\label{sec:orgbeade2b}
Komponent arkitektur, hver komponent kan have egen arkitektur til de behov som komponenten nu har brug for. hver ting fungere for sig, de kan dog sættes sammen på en eller anden måde.

design-klassediagram 

\section{Kodestandarder}
\label{sec:orgd03d836}
\begin{itemize}
\item Tuborg klammers position:
\begin{verbatim}
public void method(...)
{
// method body.
}
\end{verbatim}

\item One liners til simple metoder såsom getters og setters:
\begin{verbatim}
T member = null;
public T getMember() { return member; }
public void setMember(T member) { this.member = member; }
\end{verbatim}

\item Ternære operationer er tilladt:
\begin{verbatim}
int foo = 1;
int bar = 1;
public boolean ternary() { return foo == bar ? true : false; }
\end{verbatim}
\end{itemize}
\end{document}
